app/controllers/api/v1/products_controller.rb

INSERT INTO "products" ("title", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", nil], ["description", nil], ["price", nil], ["created_at", "2022-04-07 06:15:58.068572"], ["updated_at", "2022-04-07 06:15:58.068572"]]
---
            def create
                # data=json_payload

                # product =Product.new(data)
                product = Product.create(
                    title: params[:title],
                    description: params[:description],
                    price: params[:price]
                )

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "products" SET "title" = $1, "description" = $2, "price" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["title", nil], ["description", nil], ["price", nil], ["updated_at", "2022-04-07 06:26:59.211225"], ["id", 3]]
---
            def update
                product=Product.find(params[:id])

                product.update(
                    title: params[:title],
                    description: params[:description],
                    price: params[:price]
                )

SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 7]]
---
            def destroy
                product=Product.find(params[:id])
                product.destroy